[
    {
        "role": "Actuarial Data Analyst Intern",
        "organisation": "Munich RE",
        "dates": [
            {
                "startDate": "Jan 2025",
                "endDate": "Present"
            }
        ],
        "experiences": [
            "Processed and transformed raw data from clients using Excel VBA, Python and SQL scripts before building the dashboards",
            "Maintained and developed dashboards of Key Treaty Agreements using PowerBI, monitoring the performance of each treaty",
            "Analyzed and presented unusual observations using the dashboards, allowing the team to do a further check on the accuracy of the data",
            "Optimised the refreshing of the dashboard by 25% using more efficient Python and DAX queries"
        ],
        "skills": [
            "Data Processing",
            "Data Visualisation"
        ]
    },
    {
        "role": "BT1101 Teaching Assistant",
        "organisation": "NUS School of Computing",
        "dates": [
            {
                "startDate": "Aug 2024",
                "endDate": "Dec 2024"
            }
        ],
        "experiences": [
            "Taught students foundational statistical and business analytics concepts",
            "Conducted lab sessions assisting students to be more familiar with R Studio",
            "Conducted more than 15 consultation sessions with students who seeked help",
            "Teaching feedback score of 4.6 (Department Average: 4.1), and nominated for teaching awards by around half of the respondents of the feedback survey"
        ],
        "skills": [
            "Soft Skills",
            "R Programming"
        ]
    },
    {
        "role": "IT Project Assistant",
        "organisation": "ThinkSmart Pte Ltd",
        "dates": [
            {
                "startDate": "May 2024",
                "endDate": "Aug 2024"
            },
            {
                "startDate": "Dec 2022",
                "endDate": "May 2023"
            }
        ],
        "experiences": [
            "Increased operational efficiency by 30% by automating key IT processes and tasks for projects.",
            "Visualised business insights effectively by designing and deploying interactive dashboards using Power BI",
            "Automated training processes for an engineering company by conducting research and implementing a SharePoint-based solution."
        ],
        "skills": [
            "Automation",
            "Data Visualisation"
        ]
    }
]